{
  "navigation": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "articles": "Articles"
  },
  "home": {
    "head.title": "Home Page",
    "page.title": "Turning Vision Into Reality",
    "subtitle": "As a full-stack developer, I transform creative ideas into innovative web solutions, delivering intuitive and impactful digital experiences.",
    "resume": "Resume",
    "contact": "Contact",
    "copied": "Copied!"
  },
  "about": {
    "head.title": "About Page",
    "title": "Passion Fuels Purpose!",
    "biography": {
      "title": "Biography",
      "paragraphs": [
        "Hi, I'm Ihor, a software developer with a passion for building efficient, high-quality web applications and exploring the world of blockchain technology. With hands-on experience in React, Node.js, and blockchain development, I am dedicated to creating scalable, user-friendly solutions that drive value.",
        "I believe that coding is more than just writing lines of code – it’s about solving real-world problems, building innovative solutions, and enhancing the user experience. Whether I’m working on a full-stack application, refining a UI, or exploring decentralized systems, I bring a commitment to excellence and a constant drive to improve.",
        "I look forward to bringing my skills, passion, and creative problem-solving to your next project."
      ]
    },
    "satisfied-clients": "satisfied clients",
    "projects-completed": "projects completed",
    "years-of-experience": "years of experience",
    "show-more-button": "Show More",
    "show-less-button": "Show Less",
    "skills": "SKILLS",

    "education": {
      "title": "Education",
      "type": "Bachelor Of Science In Computer Engineering",
      "place": "Lviv Polytechnic National University",
      "info": "Object-Oriented Programming, Data Structures and Algorithms, Computer Systems Engineering, Software Development, Network Programming and other."
    },

    "experience": {
      "title": "Experience",
      "cgs-team": {
        "position": "Full-stack Developer",
        "address": "Ukraine",
        "description": "Developing from start to finish projects with direct client interaction, participating in all stages of development, from design and architecture to deployment and optimization.",
        "responsibilities": [
          "Engaged in full-stack development using the latest tools and best practices",
          "Provided solutions for tasks and implemented them",
          "Deployed projects and maintained them across different environments",
          "Refactored and migrated legacy code",
          "Participated in analysis, design, coding, and testing",
          "Analyzing and clarifying project requirements",
          "Estimating tasks and timelines for development cycles"
        ]
      },
      "goit": {
        "position": "React Mentor",
        "address": "Ukraine",
        "description": "Mentored students on the React course, providing guidance on mastering key concepts. Evaluated homework submissions and offered personalized feedback to help improve their skills.",
        "responsibilities": [
          "Providing guidance and support to students in understanding and implementing React concepts and best practices",
          "Assisting students in identifying and resolving their issues",
          "Tracking and evaluating students' progress and providing constructive feedback for improvement;",
          "Collaborating with other mentors and instructors to improve the learning process"
        ]
      },
      "softserve": {
        "position": "Full-stack Developer",
        "address": "Ukraine",
        "description": "Worked on a commercial site for selling bags with an admin panel, following Scrum methodology. Actively collaborated with team members and other departments throughout the development process.",
        "responsibilities": [
          "Participated in analysis, design, coding, and testing",
          "Reviewing and providing feedback on pull requests",
          "Analyzing and clarifying project requirements",
          "Estimating tasks and timelines for development cycles",
          "Covering code with unit tests",
          "Participated in Agile development meetings and followed Agile processes"
        ]
      }
    }
  },
  "projects": {
    "head.title": "Projects Page",
    "title": "Explore My Expertise in Crafting Scalable, Impactful Web Solutions — Each with Its Own Story and Purpose.",
    "visit": "Visit",
    "more": "More",
    "view-more": "View Full Image",

    "todo": {
      "description": "This advanced Todo app is built with a React frontend, Express and Node.js backend, and PostgreSQL database using TypeORM. It includes authorization features such as registration, password reset, and password change. Todos can be public or private: public Todos are viewable by all without logging in, while private Todos are accessible only to their owner. The app is fully responsive with adaptive Todo views for different devices: infinite scroll on mobile, infinite slider on tablet, and table view on desktop. Users can add, edit, filter, and search Todos. For more details, visit the Todo app GitHub repository."
    },
    "chat": {
      "description": "This is a simple chat app developed as a quick solution to meet specific requirements within a time-constrained technical task for a company interview. The app demonstrates a clean and functional UI, along with a responsive design for different devices, highlighting my ability to quickly deliver effective, user-friendly interfaces according to requirements."
    },
    "game-site": {
      "description": "One of my first projects, where I practiced using the Bootstrap library with plain HTML and CSS."
    },
    "health-care-center": {
      "description": "One of my first projects, where I practiced creating responsive layouts using CSS Flexbox."
    },
    "yummy-meals": {
      "description": "Project created while completing a React course, using Firebase as the database."
    },
    "black-white": {
      "description": "An early project focused on building responsive website layouts."
    },
    "hiking-club": {
      "description": "An early project focused on building responsive website layouts with dark theme."
    },
    "active-box": {
      "description": "An early project focused on building responsive website layouts with dark theme."
    },
    "fan-club": {
      "description": "A responsive website project that I thoroughly enjoyed working on during the early stages of my development journey. It was a technical task with minimal restrictions: I was limited to using plain HTML and CSS, adaptive design, and a basic site blueprint. The website includes two main pages—Home and Fans—which are fully functional and ready to explore, while the remaining pages are left blank."
    },
    "mobile-shop": {
      "description": "My first website built with React under the guidance of my mentor, and my first experience using a relational database with an Express server. Good old days!"
    },
    "expense-tracker": {
      "description": "A project to practice the basics of React."
    }
  }
}
