{
  "navigation": {
    "home": "Головна",
    "about": "Про мене",
    "projects": "Проєкти",
    "articles": "Статті"
  },
  "home": {
    "head.title": "Головна сторінка",
    "page.title": "Перетворюю бачення в реальність за допомогою коду та дизайну."
  },
  "about": {
    "head.title": "Про мене",
    "title": "Пристрасть живить мету!",
    "biography": {
      "title": "Біографія",
      "paragraphs": [
        "Привіт, я Ігор, розробник програмного забезпечення, який захоплюється створенням ефективних, якісних веб-додатків та дослідженням світу блокчейн-технологій. Маючи практичний досвід у React, Node.js та блокчейн-розробці, я прагну створювати масштабовані, зручні рішення, які приносять цінність.",
        "Я вважаю, що програмування – це більше, ніж просто написання коду, це про вирішення реальних проблем, створення інноваційних рішень і покращення користувацького досвіду. Незалежно від того, чи працюю я над повноцінним додатком, вдосконалюю інтерфейс користувача або досліджую децентралізовані системи, я підходжу до цього з прагненням до досконалості та постійним бажанням розвиватися.",
        "З нетерпінням чекаю можливості застосувати свої навички, пристрасть та творчий підхід до вирішення проблем у вашому проєкті."
      ]
    },
    "satisfied-clients": "задоволених клієнтів",
    "projects-completed": "завершених проєктів",
    "years-of-experience": "років досвіду",
    "show-more-button": "Розгорнути",
    "show-less-button": "Згорнути",

    "experience": {
      "title": "Досвід",
      "cgs-team": {
        "position": "Full-stack Розробник",
        "address": "Україна",
        "description": "Розробка проектів від початку до кінця з безпосередньою взаємодією з клієнтом, участь у всіх етапах розробки: від дизайну та архітектури до деплойменту та оптимізації.",
        "responsibilities": [
          "Займався фулл-стек розробкою з використанням найновіших інструментів і найкращих практик.",
          "Надавав рішення для тасок і реалізовував їх.",
          "Розгортав проекти та підтримував їх у різних середовищах.",
          "Рефакторив і мігрував застарілий код.",
          "Брав участь в аналізі, дизайні, кодуванні та тестуванні.",
          "Аналізував та уточнював вимоги проекту.",
          "Оцінював завдання та терміни для циклів розробки."
        ]
      },
      "goit": {
        "position": "React Ментор",
        "address": "Україна",
        "description": "Менторив студентів на курсі React, надаючи підтримку у засвоєнні ключових концепцій. Оцінював домашні завдання та надавав індивідуальний зворотний зв'язок для покращення засвоєння матеріалу.",
        "responsibilities": [
          "Надавав підтримку студентам у розумінні та впровадженні концепцій React та найкращих практик.",
          "Допомагав студентам у виявленні та вирішенні їхніх проблем.",
          "Відстежував і оцінював прогрес студентів, надаючи конструктивний зворотний зв'язок.",
          "Співпрацював з іншими менторами та викладачами для покращення процесу навчання."
        ]
      },
      "softserve": {
        "position": "Full-stack Розробник",
        "address": "Україна",
        "description": "Працював над комерційним сайтом для продажу сумок з адміністративною панеллю, дотримуючись методології Scrum. Активно співпрацював з членами команди та іншими відділами протягом всього процесу розробки.",
        "responsibilities": [
          "Брав участь в аналізі, дизайні, кодуванні та тестуванні.",
          "Переглядав та надавав зворотний зв'язок щодо пул-запитів.",
          "Аналізував і уточнював вимоги проекту.",
          "Оцінював завдання та терміни для циклів розробки.",
          "Покривав код модульними тестами.",
          "Брав участь у зустрічах Agile-розробки та дотримувався Agile-процесів."
        ]
      }
    }
  }
}
